In [32]:
import pandas as pd
import numpy as np

In [33]:
# Creating Series
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s3 = pd.Series({'a': 1, 'b': 2, 'c': 3})


print(s1)
print(s3.index)         # Index(['a', 'b', 'c'], dtype='object')
print(s2['c'])          # 30 
print(s2.values)        # array [10 20 30]



# Series Operations
s4 = pd.Series([1, 2, 3])
s5 = pd.Series([4, 5, 6])
print(s4 + s5)              # Element-wise addition


# From list of dictionaries
data_list = [
    {'Name': 'Alice', 'Age': 25, 'City': 'NYC'},
    {'Name': 'Bola', 'Age': 30, 'City': 'LA'}
]
df2 = pd.DataFrame(data_list)
print(df2)

# From NumPy array
arr = np.random.rand(4, 3)
df3 = pd.DataFrame(arr, columns=['A', 'B', 'C'])

print(df3)

d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
d1 = pd.DataFrame(data=d, index=[0, 1, 2, 3])

d1

0    1
1    2
2    3
3    4
4    5
dtype: int64
Index(['a', 'b', 'c'], dtype='object')
30
[10 20 30]
0    5
1    7
2    9
dtype: int64
    Name  Age City
0  Alice   25  NYC
1   Bola   30   LA
          A         B         C
0  0.748757  0.705612  0.207480
1  0.970330  0.029535  0.288588
2  0.408131  0.653526  0.457963
3  0.041306  0.749129  0.083763

   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

In [34]:
# Creating DataFrames
# From dictionary
data = {
    'first': ['Alice', 'Bola', 'Bola', 'Charlie23', 'David', 'Alice10'],
    'last': ['Kent', 'Lukman', 'Hangman', 'Maicah', 'Freedom', 'Pencer'],
    'age': [25, 30, 30, 35, 37, 41],
    'city': ['NYC', 'LA', 'LA', 'Chicago', 'Miami', 'Lagos'],
    'salary': [70000, 80000, 80000, 90000, 75000, 90000]
}
df = pd.DataFrame(data)     #  pd.DataFrame(data, index=[0, 1, 2, 3])
print(df)


print(df.columns)                   # Index(['Name', 'Age', 'City', 'Salary'], dtype='object')
print(df.index)           # Index: RangeIndex(start=0, stop=4, step=1)
print(df.dtypes.values)             # Data types: [dtype('O') dtype('int64') dtype('O') dtype('int64')]
# print(df.head())       # first 5 rows
# print(df.tail())       # last 5 rows
# print(df.shape)        # (rows, cols)
# print(df.dtypes)       # data types
# print(df.info())       # summary
# print(df.describe())   # stats for numeric columns

       first     last  age     city  salary
0      Alice     Kent   25      NYC   70000
1       Bola   Lukman   30       LA   80000
2       Bola  Hangman   30       LA   80000
3  Charlie23   Maicah   35  Chicago   90000
4      David  Freedom   37    Miami   75000
5    Alice10   Pencer   41    Lagos   90000
Index(['first', 'last', 'age', 'city', 'salary'], dtype='object')
RangeIndex(start=0, stop=6, step=1)
[dtype('O') dtype('O') dtype('int64') dtype('O') dtype('int64')]

In [35]:
# Column selection
print(df['first'])           # Single column (Series)
df[['first', 'age']]  # Multiple columns (DataFrame)

0        Alice
1         Bola
2         Bola
3    Charlie23
4        David
5      Alice10
Name: first, dtype: object

       first  age
0      Alice   25
1       Bola   30
2       Bola   30
3  Charlie23   35
4      David   37
5    Alice10   41

In [37]:
# Row selection by index

print(df.iloc[0])           # First row by position  # iloc - integer locate
print(df.iloc[0:3])         # using slicing 
print(df.iloc[[0, 2]])      # Specific rows
print(df.iloc[0:3])         # 0 to 3 rows # loc include the last row
print(df.loc[0:3])          # loc- locate

first     Alice
last       Kent
age          25
city        NYC
salary    70000
Name: 0, dtype: object
   first     last  age city  salary
0  Alice     Kent   25  NYC   70000
1   Bola   Lukman   30   LA   80000
2   Bola  Hangman   30   LA   80000
   first     last  age city  salary
0  Alice     Kent   25  NYC   70000
2   Bola  Hangman   30   LA   80000
   first     last  age city  salary
0  Alice     Kent   25  NYC   70000
1   Bola   Lukman   30   LA   80000
2   Bola  Hangman   30   LA   80000
       first     last  age     city  salary
0      Alice     Kent   25      NYC   70000
1       Bola   Lukman   30       LA   80000
2       Bola  Hangman   30       LA   80000
3  Charlie23   Maicah   35  Chicago   90000

In [38]:
# Conditional selection using filters
filt = (df['age'] > 28)
print(df[filt])               # Age > 28

filt1 = (df['age'] > 28) & (df['city'] == 'LA')
print(df[filt1])  # Multiple conditions

filt2 = df['first'].str.startswith('A')
print(df[filt2])  # first name starts with A

filt3 = df['first'].str.endswith('e')
print(df[filt3])  # first name end with e

print(df.query('age > 28 and salary > 75000'))      # query() method

# isin() for multiple values
filt4 = df['city'].isin(['NYC', 'LA'])
print(df[filt4])  # if  'NYC', 'LA' is in "CITY"


# at and iat for scalar access
print(df.at[0, 'first'])     # Fast access by label
df.iat[0, 2]         # 25

       first     last  age     city  salary
1       Bola   Lukman   30       LA   80000
2       Bola  Hangman   30       LA   80000
3  Charlie23   Maicah   35  Chicago   90000
4      David  Freedom   37    Miami   75000
5    Alice10   Pencer   41    Lagos   90000
  first     last  age city  salary
1  Bola   Lukman   30   LA   80000
2  Bola  Hangman   30   LA   80000
     first    last  age   city  salary
0    Alice    Kent   25    NYC   70000
5  Alice10  Pencer   41  Lagos   90000
   first  last  age city  salary
0  Alice  Kent   25  NYC   70000
       first     last  age     city  salary
1       Bola   Lukman   30       LA   80000
2       Bola  Hangman   30       LA   80000
3  Charlie23   Maicah   35  Chicago   90000
5    Alice10   Pencer   41    Lagos   90000
   first     last  age city  salary
0  Alice     Kent   25  NYC   70000
1   Bola   Lukman   30   LA   80000
2   Bola  Hangman   30   LA   80000
Alice

np.int64(25)

In [39]:
df

       first     last  age     city  salary
0      Alice     Kent   25      NYC   70000
1       Bola   Lukman   30       LA   80000
2       Bola  Hangman   30       LA   80000
3  Charlie23   Maicah   35  Chicago   90000
4      David  Freedom   37    Miami   75000
5    Alice10   Pencer   41    Lagos   90000

In [40]:
# Row selection by label
df_indexed = df.set_index('age')        # set index by column
print(df_indexed)
print(df_indexed.loc[41])          # Row by label
print(df_indexed.loc[[25, 35]])     # Multiple rows

         first     last     city  salary
age
25       Alice     Kent      NYC   70000
30        Bola   Lukman       LA   80000
30        Bola  Hangman       LA   80000
35   Charlie23   Maicah  Chicago   90000
37       David  Freedom    Miami   75000
41     Alice10   Pencer    Lagos   90000
first     Alice10
last       Pencer
city        Lagos
salary      90000
Name: 41, dtype: object
         first    last     city  salary
age
25       Alice    Kent      NYC   70000
35   Charlie23  Maicah  Chicago   90000

In [41]:
# Convert data types
df['age'] = df['age'].astype(float)   # this can be used
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')         # this can be used

print(df['age'])

# Convert to categorical
df['city'] = df['city'].astype('category')
print(df['city'])

0    25.0
1    30.0
2    30.0
3    35.0
4    37.0
5    41.0
Name: age, dtype: float64
0        NYC
1         LA
2         LA
3    Chicago
4      Miami
5      Lagos
Name: city, dtype: category
Categories (5, object): ['Chicago', 'LA', 'Lagos', 'Miami', 'NYC']

In [42]:
# Find duplicates
print(df.duplicated())                    # Boolean series, if rows is in duplicate 
print(df.duplicated(subset=['first']))     # to check specific columns


# Drop duplicates
df_unique = df.drop_duplicates()            # drop one duplicated from row
df_unique_cols = df.drop_duplicates(subset=['first', 'city'], )    # drop one duplicated specific columns
df_keep_last = df.drop_duplicates(keep='last')

print(df_unique_cols)

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool
0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool
       first     last   age     city  salary
0      Alice     Kent  25.0      NYC   70000
1       Bola   Lukman  30.0       LA   80000
3  Charlie23   Maicah  35.0  Chicago   90000
4      David  Freedom  37.0    Miami   75000
5    Alice10   Pencer  41.0    Lagos   90000

In [44]:
# Adding/Removing Columns
df['first'] = df['first'].str.lower()
df['last'] = df['last'].str.title()
df['city'] = df['city'].str.upper()
df['count'] = df['first'].str.len()
df['name_contains'] = df['first'].str.contains('ali')        # Boolean
df['replace_first'] = df['first'].str.replace('alice', 'ayo')
df['Full_Name'] = df['first'] + ' ' + df['last']        # concatenant two together

# Extract patterns with regex
df['Digit'] = df['first'].str.extract(r'(\d+)')

In [45]:
df.drop(columns=['first', 'last'], inplace=True)    # dropping a column

In [46]:
df

,age,city,salary,count,name_contains,replace_first,Full_Name,Digit
0,25.0,NYC,70000,5,True,ayo,alice Kent,NaN
1,30.0,LA,80000,4,False,bola,bola Lukman,NaN
2,30.0,LA,80000,4,False,bola,bola Hangman,NaN
3,35.0,CHICAGO,90000,9,False,charlie23,charlie23 Maicah,23
4,37.0,MIAMI,75000,5,False,david,david Freedom,NaN
5,41.0,LAGOS,90000,7,True,ayo10,alice10 Pencer,10

In [47]:
# Split strings
df[['first', 'last']] = df['Full_Name'].str.split(' ', expand=True)   # to get the 'first and last'

In [48]:
df

,age,city,salary,count,name_contains,replace_first,Full_Name,Digit,first,last
0,25.0,NYC,70000,5,True,ayo,alice Kent,NaN,alice,Kent
1,30.0,LA,80000,4,False,bola,bola Lukman,NaN,bola,Lukman
2,30.0,LA,80000,4,False,bola,bola Hangman,NaN,bola,Hangman
3,35.0,CHICAGO,90000,9,False,charlie23,charlie23 Maicah,23,charlie23,Maicah
4,37.0,MIAMI,75000,5,False,david,david Freedom,NaN,david,Freedom
5,41.0,LAGOS,90000,7,True,ayo10,alice10 Pencer,10,alice10,Pencer

In [49]:
# Adding/Removing rows

df.loc[len(df)] = {'first': 'emma', 'last': 'phillip'} # adding a row  to the last number
df.loc[2] = {'first': 'maxwell', 'salary': 70000}    # overright the data at index 2

In [50]:
df

,age,city,salary,count,name_contains,replace_first,Full_Name,Digit,first,last
0,25.0,NYC,70000.0,5.0,1.0,ayo,alice Kent,NaN,alice,Kent
1,30.0,LA,80000.0,4.0,0.0,bola,bola Lukman,NaN,bola,Lukman
2,NaN,NaN,70000.0,NaN,NaN,NaN,NaN,NaN,maxwell,NaN
3,35.0,CHICAGO,90000.0,9.0,0.0,charlie23,charlie23 Maicah,23,charlie23,Maicah
4,37.0,MIAMI,75000.0,5.0,0.0,david,david Freedom,NaN,david,Freedom
5,41.0,LAGOS,90000.0,7.0,1.0,ayo10,alice10 Pencer,10,alice10,Pencer
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,emma,phillip

In [51]:
df.drop(index=[2,6], inplace=True)
df.drop(columns=['name_contains'], inplace=True)

In [52]:
df

,age,city,salary,count,replace_first,Full_Name,Digit,first,last
0,25.0,NYC,70000.0,5.0,ayo,alice Kent,NaN,alice,Kent
1,30.0,LA,80000.0,4.0,bola,bola Lukman,NaN,bola,Lukman
3,35.0,CHICAGO,90000.0,9.0,charlie23,charlie23 Maicah,23,charlie23,Maicah
4,37.0,MIAMI,75000.0,5.0,david,david Freedom,NaN,david,Freedom
5,41.0,LAGOS,90000.0,7.0,ayo10,alice10 Pencer,10,alice10,Pencer

In [53]:
df.reset_index(drop=True, inplace=True)

In [54]:
df

,age,city,salary,count,replace_first,Full_Name,Digit,first,last
0,25.0,NYC,70000.0,5.0,ayo,alice Kent,NaN,alice,Kent
1,30.0,LA,80000.0,4.0,bola,bola Lukman,NaN,bola,Lukman
2,35.0,CHICAGO,90000.0,9.0,charlie23,charlie23 Maicah,23,charlie23,Maicah
3,37.0,MIAMI,75000.0,5.0,david,david Freedom,NaN,david,Freedom
4,41.0,LAGOS,90000.0,7.0,ayo10,alice10 Pencer,10,alice10,Pencer

In [24]:
# Insert column at specific position
df.insert(1, 'Department', ['HR', 'IT', 'Finance', 'HR', 'Repairer'])
# print(df)

# Rename columns
df_renamed = df.rename(columns={'Full_Name': 'full_name', 'City': 'Location'})



# ===  Append another DataFrame
# df2 = pd.DataFrame({"name": ["Femi"], "score": [88]})
# df = pd.concat([df, df2], ignore_index=True)
# print(df)

In [55]:
df

,age,city,salary,count,replace_first,Full_Name,Digit,first,last
0,25.0,NYC,70000.0,5.0,ayo,alice Kent,NaN,alice,Kent
1,30.0,LA,80000.0,4.0,bola,bola Lukman,NaN,bola,Lukman
2,35.0,CHICAGO,90000.0,9.0,charlie23,charlie23 Maicah,23,charlie23,Maicah
3,37.0,MIAMI,75000.0,5.0,david,david Freedom,NaN,david,Freedom
4,41.0,LAGOS,90000.0,7.0,ayo10,alice10 Pencer,10,alice10,Pencer

In [56]:
# Apply function to series
df['Age_Squared'] = df['age'].apply(lambda x: x ** 2)


# Apply function to DataFrame
def calculate_tax(salary):
    if salary > 80000:
        return salary * 0.3
    return salary * 0.2

df['tax'] = df['salary'].apply(calculate_tax)


def salary_category(row):
    if row['salary'] > 85000 and row['age'] >= 35:
        return 'High man'
    elif row['salary'] > 70000 and row['age'] >= 30:
        return 'Medium'
    return 'Low'

df['category'] = df.apply(salary_category, axis=1)


#  Vectorized operations (faster than apply)
df['Salary_K'] = df['salary'] / 1000  # Vectorized is faster

# Using map for categorical mapping - single
city_to_state = {'NYC': 'NY', 'LA': 'CA', 'CHICAGO': 'IL', 'MIAMI': 'FL', 'LAGOS': 'Nigeria'}
df['state'] = df['city'].map(city_to_state)


# Using applymap for element-wise operations - multiple
df_numeric = df[['age', 'salary']].applymap(lambda x: f'${x:,.2f}' if x > 0 else 'N/A')

df_numeric

C:\Users\tseun\AppData\Local\Temp\ipykernel_30896\1246973152.py:33: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_numeric = df[['age', 'salary']].applymap(lambda x: f'${x:,.2f}' if x > 0 else 'N/A')

      age      salary
0  $25.00  $70,000.00
1  $30.00  $80,000.00
2  $35.00  $90,000.00
3  $37.00  $75,000.00
4  $41.00  $90,000.00

In [57]:
df

,age,city,salary,count,replace_first,Full_Name,Digit,first,last,Age_Squared,tax,category,Salary_K,state
0,25.0,NYC,70000.0,5.0,ayo,alice Kent,NaN,alice,Kent,625.0,14000.0,Low,70.0,NY
1,30.0,LA,80000.0,4.0,bola,bola Lukman,NaN,bola,Lukman,900.0,16000.0,Medium,80.0,CA
2,35.0,CHICAGO,90000.0,9.0,charlie23,charlie23 Maicah,23,charlie23,Maicah,1225.0,27000.0,High man,90.0,IL
3,37.0,MIAMI,75000.0,5.0,david,david Freedom,NaN,david,Freedom,1369.0,15000.0,Medium,75.0,FL
4,41.0,LAGOS,90000.0,7.0,ayo10,alice10 Pencer,10,alice10,Pencer,1681.0,27000.0,High man,90.0,Nigeria

In [58]:
# Basic groupby
grouped = df.groupby('city')
print(grouped.groups)   # Show groups

# Aggregate functions
agg_result = df.groupby('city').agg({
    'age': ['mean', 'min', 'max', 'count'],
    'salary': ['sum', 'mean', 'std']
})
print(agg_result)

# Multiple aggregations per column
result = df.groupby('city')['salary'].agg(['mean', 'sum', 'count', 'std'])
print(result)



# Groupby with multiple columns
multi_group = df.groupby(['city', 'age']).agg({'salary': 'mean'})
print(multi_group)

{'CHICAGO': [2], 'LA': [1], 'LAGOS': [4], 'MIAMI': [3], 'NYC': [0]}
          age                     salary
         mean   min   max count      sum     mean std
city
CHICAGO  35.0  35.0  35.0     1  90000.0  90000.0 NaN
LA       30.0  30.0  30.0     1  80000.0  80000.0 NaN
LAGOS    41.0  41.0  41.0     1  90000.0  90000.0 NaN
MIAMI    37.0  37.0  37.0     1  75000.0  75000.0 NaN
NYC      25.0  25.0  25.0     1  70000.0  70000.0 NaN
            mean      sum  count  std
city
CHICAGO  90000.0  90000.0      1  NaN
LA       80000.0  80000.0      1  NaN
LAGOS    90000.0  90000.0      1  NaN
MIAMI    75000.0  75000.0      1  NaN
NYC      70000.0  70000.0      1  NaN
               salary
city    age
CHICAGO 35.0  90000.0
LA      30.0  80000.0
LAGOS   41.0  90000.0
MIAMI   37.0  75000.0
NYC     25.0  70000.0

In [63]:
# Create sample data with missing values
df_missing = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, np.nan, 8],
    'C': [9, 10, 11, 12]
})

# Check missing values
print(df_missing.isnull())              # Missing values     
print(df_missing.isnull().sum())        # Sum of missing


# Drop missing values
df_dropped = df_missing.dropna()          # Drop rows with any NaN
df_dropped_col = df_missing.dropna(axis=1) # Drop columns with any NaN


# Fill missing values
df_filled = df_missing.fillna(1)          # Fill with 1
df_filled_mean = df_missing.fillna(df_missing.mean())  # Fill with column mean
df_filled_ffill = df_missing.fillna(method='ffill')    # Forward fill
df_filled_bfill = df_missing.fillna(method='bfill')    # Backward fill
print(df_filled_bfill)

# # Interpolation
df_interpolated = df_missing.interpolate()  # Linear interpolation

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False  False
A    1
B    2
C    0
dtype: int64
     A    B   C
0  1.0  5.0   9
1  2.0  8.0  10
2  4.0  8.0  11
3  4.0  8.0  12

C:\Users\tseun\AppData\Local\Temp\ipykernel_30896\1960397683.py:21: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df_missing.fillna(method='ffill')    # Forward fill
C:\Users\tseun\AppData\Local\Temp\ipykernel_30896\1960397683.py:22: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_bfill = df_missing.fillna(method='bfill')    # Backward fill

In [60]:
# Sample DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value2': [4, 5, 6]})
df3 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value3': [7, 8, 9]})

# Merge (like SQL JOIN)
# Inner join (default)
merged_inner = pd.merge(df1, df2, on='key', how='inner')
print(merged_inner)

# Left join
merged_left = pd.merge(df1, df2, on='key', how='left')
print(merged_left)


# Right join
merged_right = pd.merge(df1, df2, on='key', how='right')
print(merged_right)

# Outer join
merged_outer = pd.merge(df1, df2, on='key', how='outer')
print(merged_outer)

# # Merge on multiple keys
# merged_multi = pd.merge(df1, df2, on=['key1', 'key2'])

# # Merge with different column names
# merged_diff = pd.merge(df1, df2, left_on='key1', right_on='key2')

# Join (on index)
joined = df1.join(df3.set_index('key'), on='key')
print(joined)

merged_inner = pd.merge(df1, df3, on='key', how='inner')

# Concatenation
concat_rows = pd.concat([df1, df2], axis=0, ignore_index=True)  # Stack rows
concat_cols = pd.concat([df1, df2], axis=1)  # Stack columns

print(joined)
print(concat_rows)

  key  value1  value2
0   B       2       4
1   C       3       5
  key  value1  value2
0   A       1     NaN
1   B       2     4.0
2   C       3     5.0
  key  value1  value2
0   B     2.0       4
1   C     3.0       5
2   D     NaN       6
  key  value1  value2
0   A     1.0     NaN
1   B     2.0     4.0
2   C     3.0     5.0
3   D     NaN     6.0
  key  value1  value3
0   A       1       7
1   B       2       8
2   C       3       9
  key  value1  value3
0   A       1       7
1   B       2       8
2   C       3       9
  key  value1  value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     NaN
3   B     NaN     4.0
4   C     NaN     5.0
5   D     NaN     6.0

In [ ]:
# Reading data
df_csv = pd.read_csv('data.csv')
df_excel = pd.read_excel('data.xlsx')
df_json = pd.read_json('data.json')
# df_sql = pd.read_sql('SELECT * FROM table', connection)



# read_csv parameters
df = pd.read_csv('data.csv', 
                 sep=',',           # separator
                 header=0,          # row number for header
                 index_col=0,       # column to use as index
                 na_values=['NA', 'NULL'],  # values to treat as NaN
                 dtype={'column1': str, 'column2': int},  # data types
                 parse_dates=['date_column'],  # parse dates
                 nrows=1000,        # read only first 1000 rows
                 encoding='utf-8')  # file encoding

# Writing data
df.to_csv('output.csv', index=False)
df.to_excel('output.xlsx', sheet_name='Data')
df.to_json('output.json', orient='records')
# df.to_sql('table_name', connection, if_exists='replace')

FileNotFoundError: [Errno 2] No such file or directory: 'data.csv'